{
  "summary": {
    "total": "Highly skilled and motivated Developer with 6+ years of experience."
  },
  "personalInfo": {
    "name": "John",
    "title": "Developer",
    "email": "my.email@example.com",
    "phone": "123-456-7890",
    "address": "123 New St, New City, NC"
  },
  "education": {
    "institution": " DUKE",
    "degree": "Bachelor of Science in Computer Science ",
    "date": "2020 - 2022"
  },
  "workExperience": [
    {
      "company": "AAN Consulting Corporation, NY",
      "position": "Software QA Engineer",
      "date": "March 2021 - Present",
      "description": "Collaboration with cross-functional teams to develop and implement testing strategies and test plans Designing, developing, and executing automated test scripts using JS, Cypress, Mocha, Chai Implemented the Page Object design pattern for automation scripts and conducted BDD testing using Cucumber Managing bug tracking using Jira and working with developers to resolve defects in a timely manner Participating in Agile software development processes and providing regular progress updates Conducting smoke and regression testing after bug fixes and new releases Worked on automated testing of web applications."
    },
    {
      "company": "FrikShun, Cary",
      "position": "QA Automation Engineer",
      "date": "January 2020 - March 2021",
      "description": "Utilized Selenium WebDriver to write end-to-end tests for a web application. Simulated user interactions and ensured maximum test coverage across multiple browsers and plat-forms using Selenium Grid. Developed an automated testing framework for a complex web application using Selenium and the POM  pattern, allowed for easy maintenance and new test creation. Conducted regression testing after bug fixes and new releases. Maintained and updated test documentation, including test cases and test results"
    },
    {
      "company": "ECCO Shoes, Moscow",
      "position": "QA Tester",
      "date": "April 2016 - December 2019",
      "description": "Analyzed requirements and created detailed, comprehensive test plans. Designed and executed manual test cases for various functionalities. Conducted regression testing after bug fixes and new releases"
    }
  ],
  "skills": [
    "JavaScript",
    "HTML",
    "CSS",
    "XML",
    "Cypress",
    "Mocha",
    "Chai",
    "Node.js",
    "POM",
    "Cucumber",
    "BDD",
    "Postman",
    "MySQL",
    "GitHub",
    "Jenkins",
    "GitHub Actions",
    "API Testing"
  ]
}